lierda-iot/WizBlock/CODE/examples/lte_net_demo/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_32=y

# Network manager configuration - DUAL mode (WiFi preferred, 4G fallback)
CONFIG_NETWORK_MANAGER_ENABLE=y
CONFIG_NETWORK_MANAGER_DEFAULT_DUAL_AUTO=y
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=5
CONFIG_DEMO_NETWORK_MODE_DUAL=y
CONFIG_DEMO_DEFAULT_WIFI_SSID="lierda-guest"
CONFIG_DEMO_DEFAULT_WIFI_PASSWORD="lsd920249"
# Fast DUAL_AUTO failover/recovery: keep 4G visible while Wi-Fi retries often.
CONFIG_NETWORK_MANAGER_WIFI_CONNECT_STABLE_MS=2000
CONFIG_NETWORK_MANAGER_WIFI_DISCONNECT_STABLE_MS=500
CONFIG_NETWORK_MANAGER_WIFI_RETRY_LIMIT=255
CONFIG_NETWORK_MANAGER_WIFI_RETRY_UNLIMITED=y
CONFIG_NETWORK_MANAGER_WIFI_RETRY_INITIAL_BACKOFF_MS=250
CONFIG_NETWORK_MANAGER_WIFI_RETRY_MAX_BACKOFF_MS=500

# Reduce log noise - only INFO level for most components
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Enable debug for network components only
CONFIG_LOG_DEMO_NETWORK_LEVEL=INFO
CONFIG_LOG_NETWORK_MANAGER_LEVEL=DEBUG
CONFIG_LOG_LTE_HAL_LEVEL=INFO
CONFIG_LOG_LSD_4G_LEVEL=INFO
